{
  "Serilog": {
    "Using": [ "Serilog.Sinks.File" ],
    "MinimumLevel": {
      "Default": "Warning",
      "Override": {
        "Microsoft": "Warning"
      }
    },
    "WriteTo": [
      {
        "Name": "File",
        "Args": { "path": "Logs/log.txt" }
      }
    ],
    "Enrich": [ "FromLogContext", "WithMachineName", "WithThreadId" ]
  },
  "emailOptions": {
    "EmailRemetente": "ENDEREÇO EMAIL REMETENTE SAIDA",
    "NomeRemetente": "NOME REMETENTE SAIDA",
    "SmtpServer": "SERVIDOR SMTP",
    "Port": "PORTA SERVIDOR SMTP"
  },
  "ldapOptions": {
    "Configurations": [
      {
        "Url": "URL SERVIDOR LDAP",
        "Port": 389,
        "BindDN": "DN do usuário de serviço que será utilizado para autenticar no LDAP", //Exemplo: CN=Fulano de tal,CN=Users,DC=orgao
        "BindPassword": "Senha do usuário de serviço que será utilizado para autenticar no LDAP",
        "SearchBaseDC": "DC que será utilizado para chegar à base de usuários no LDAP", //Exemplo: CN=Users,DC=orgao
        "SearchFilter": "Consulta a ser aplicada no LDAP para encontrar os usuários", //Exemplo: (&(objectClass=user)(objectClass=person)(sAMAccountName={0}))
        "CpfAttributeFilter": "Campo do LDAP em que será encontrado o CPF do usuário",
        "EmailAttributeFilter": "Campo do LDAP em que será encontrado o e-mail do usuário"
      }
    ]
  },
  "padroesOptions": {
    "TempoComparecimento": 2,
    "TermoAceite": "Declaro que atendo às condições para participação no Programa de Gestão da Susep, que comparecerei às convocações realizadas no prazo de antecedência de quarenta e oito horas, excepcionalmente podendo ser reduzido quando houver interesse fundamentado da Administração ou pendência que não possa ser solucionada por meios telemáticos ou informatizados, que cumprirei com as minhas atribuições e responsabilidades conforme a Tabela de Atividades aprovada no Ato Normativo de procedimentos gerais e no Plano de Trabalho realizado junto à minha chefia imediata, e que tenho o dever de manter a infraestrutura necessária para o exercício das minhas atribuições, inclusive aquelas relacionadas à segurança da informação, quando estiver executando o Programa de Gestão na modalidade teletrabalho. Além disso, declaro ciência:\n\na)\tde que minha participação no Programa de Gestão não constitui direito adquirido, podendo ser desligado nas condições estabelecidas no Capítulo III da Instrução Normativa SGP/ME nº 65, de 30 de julho de 2020;\nb)\tde que eventuais despesas relacionadas ao deslocamento para minha unidade de lotação não serão custeadas, em nenhuma hipótese, pela Administração Pública;\nc) quanto à vedação de pagamento das vantagens a que se referem os arts. 29 a 36 da Instrução Normativa SGP / ME nº 65, de 30 de julho de 2020;\nd) quanto à vedação de utilização de terceiros para a execução dos trabalhos acordados como parte das metas;\ne) quanto ao dever de observar as disposições constantes da Lei nº 13.709, de 14 de agosto de 2018  Lei Geral de Proteção de Dados Pessoas(LGPD), no que couber;\nf) quanto às orientações da Portaria nº 15.543 / SEDGG / ME, de 2 de julho de 2020, que divulga o Manual de Conduta do Agente Público Civil do Poder Executivo Federal;\ng) quanto ao cumprimento do art. 22 da Instrução Normativa SGP / ME nº 65, de 30 de julho de 2020, ou seja, das atribuições e responsabilidades do participante;\nh) quanto ao cumprimento do art. 23 da Instrução Normativa SGP / ME nº 65, de 30 de julho de 2020, ou seja, que sou responsável por providenciar as estruturas física e tecnológica necessárias, mediante a utilização de equipamentos e mobiliários adequados e ergonômicos, assumindo, inclusive, os custos referentes à conexão à internet, à energia elétrica e ao telefone, entre outras despesas decorrentes do exercício de minhas atribuições; e\ni) quanto ao dever de estar disponível para atividades coletivas online, como reunião e outras formas de comunicação, pelo período acordado com a chefia, não podendo extrapolar o horário de funcionamento da Susep.",

    "EnderecoPublicacaoFront": "ENDERECO ONDE O FRONT ESTÁ PUBLICADO",

    "Notificacoes": {
      "EnviarEmail": true,
      "AberturaFaseHabilitacao": "IncluirSubunidades",

      "EmailPlanoParaAprovacao": {
        "Assunto": "[Programa de gestão] Programa de gestão enviado para aprovação",
        "Mensagem": "Prezado(a),<br><br>Um programa de gestão em unidade sob sua gestão foi enviado para aprovação."
      },
      "EmailPlanoAprovado": {
        "Assunto": "[Programa de gestão] Programa de gestão aprovado",
        "Mensagem": "Prezado(a),<br><br>Um programa de gestão em unidade sob sua gestão foi aprovado."
      },
      "EmailPlanoRejeitado": {
        "Assunto": "[Programa de gestão] Programa de gestão rejeitado",
        "Mensagem": "Prezado(a),<br><br>Um programa de gestão em unidade sob sua gestão foi rejeitado."
      },
      "EmailPlanoCandidaturaRegistrada": {
        "Assunto": "[Programa de gestão] Candidatura no programa de gestão registrada",
        "Mensagem": "Prezado(a),<br><br>Sua candidatura a uma vaga no programa de gestão foi registrada."
      },
      "EmailPlanoEmHabilitacao": {
        "Assunto": "[Programa de gestão] Habilitação iniciada",
        "Mensagem": "Prezado(a),<br><br>Está aberta a fase de habilitação de um programa de gestão na sua unidade.<br>Se for do seu interesse, candidate-se a uma das vagas."
      },
      "EmailPlanoCandidaturaAprovada": {
        "Assunto": "[Programa de gestão] Candidatura aprovada",
        "Mensagem": "Prezado(a),<br><br>Sua candidatura para vaga no programa de gestão foi aprovada.<br>Aguarde até que a execução do programa de gestão seja iniciada para que possa fazer o apontamento das suas atividades."
      },
      "EmailPlanoCandidaturaRejeitada": {
        "Assunto": "[Programa de gestão] Candidatura rejeitada",
        "Mensagem": "Prezado(a),<br><br>Sua candidatura para vaga no programa de gestão não foi aprovada.<br>Entre em contato com a sua chefia para entender os motivos."
      },
      "EmailPactoSituacaoAlterada": {
        "Assunto": "[Programa de gestão] Alteração da situação de plano de trabalho",
        "Mensagem": "Prezado(a),<br><br>Houve alteração da situação de um plano de trabalho em que você está envolvido."
      },
      "EmailPactoSolicitacaoAlteracaoPrazo": {
        "Assunto": "[Programa de gestão] Proposta de alteração de prazo",
        "Mensagem": "Prezado(a),<br><br>Uma alteração do prazo de um plano de trabalho em que você está envolvido foi solicitada."
      },
      "EmailPactoSolicitacaoNovaAtividade": {
        "Assunto": "[Programa de gestão] Proposta de nova atividade",
        "Mensagem": "Prezado(a),<br><br>Uma adição de atividade em um plano de trabalho em que você está envolvido foi solicitada."
      },
      "EmailPactoSolicitacaoExclusaoAtividade": {
        "Assunto": "[Programa de gestão] Proposta de exclusão de atividade",
        "Mensagem": "Prezado(a),<br><br>Uma exclusão de atividade de um plano de trabalho em que você está envolvido foi solicitada."
      },
      "EmailPactoSolicitacaoJustificativaEstouroPrazo": {
        "Assunto": "[Programa de gestão] Solicitação de justificativa de estouro de prazo registrada",
        "Mensagem": "Prezado(a),<br><br>Uma justificativa de estouro de prazo na execução de uma atividade em um plano de trabalho em que você está envolvido foi solicitada."
      },
      "EmailPactoSolicitacaoAnalisada": {
        "Assunto": "[Programa de gestão] Solicitação analisada",
        "Mensagem": "Prezado(a),<br><br>Uma solicitação de alteração de um plano de trabalho em que você está envolvido foi analisada."
      },
      "EmailPactoAtividadeAvaliada": {
        "Assunto": "[Programa de gestão] Avaliação de atividade",
        "Mensagem": "Prezado(a),<br><br>Uma atividade em um plano de trabalho em que você está envolvido foi avaliada."
      }
    }
  }
}
